<template>
    <v-container fluid class="pa-10">
      <v-card
        class="mx-auto"
        flat
        max-width="1000"
      >
        <v-row>
          <v-col cols="12" class="text-center pa-10">
            <h1 class="display-1 font-weight-bold mb-3">
              லஸ்ஸியைப் பற்றி அடிக்கடி கேட்கப்படும் கேள்விகள்
            </h1>
          </v-col>
          <v-col
            cols="12" class="px-10"
            v-for="(kelvi, i) in kelvikal" :key="i"
          >
            <h2
              class="headline font-weight-bold mb-3"
              v-html="compiledMarkdown(kelvi.கேள்வி )"
            >
              {{ kelvi.கேள்வி }}
            </h2>

            <div
             v-for="(badil, j) in kelvi.பதில்" :key="j"
             v-html="compiledMarkdown(badil)"
            ></div>

          </v-col>
        </v-row>
      </v-card>
    </v-container>
</template>
<script>
import marked from 'marked'

export default {
    name: 'கேள்விகள்',
    methods: {
      compiledMarkdown: (txt) => {
        console.log(marked)
        return marked(txt, { sanitize: true });
      }
    },
    data: () => ({
      kelvikal: [
        {
          'கேள்வி': 'அதின் பெயர் எதற்கு லஸ்ஸி?',
          'பதில்': ['எதற்கு வேண்டாம்?']
        },
        {
          'கேள்வி': 'எதற்கு சாதாரன் ஆங்கிலத்தில் நிரலாக்கம் செய்ய முடியாது?',
          'பதில்': [`உன்கள் மொழி எந்த இருந்தாலோ, [நிரலாக்கம் செய்யும் வாய்ப்பு இருக்க வேண்டும்](https://www.wired.com/story/coding-is-for-everyoneas-long-as-you-speak-english/).`,
          `வேவ்வேறு ஆங்கில மொழி மூலம் எழுதப்பட்ட நிரலாக்க மொழிகளில் இடையே மாற்றம் செய்யும் பல நிரல்மொழிமாற்றிகள்
           ஏற்கனவை உள்ளன. உதாரணத்துக்காக, காஃபீக்கிறிட்டு, ரியாக்ட், மற்றும் வியூ ஆகிய மொழிகள் அல்லது சட்டகங்கள்
           எல்லாம் கணினியால் பயன்ப்படுத்தும் முன்னால் யாவாக்கிறிட்டுக்கு மாற்றப்பட்டன. ஆனால் இந்த மொழிகள் எல்லாம்
           சாதாரன யாவாக்கிறிட்டு அல்லது இருமவடிவ உரையை விட நம் சின்ன மனிதர் மூளைகளுக்காக சுலபமாக இருக்கிறதால், நாம்
           இந்த மொழிகளில் தானே நிரல் குறியீடு எழுதி, இறுதியில் ஒரு நிரல்மொழிமாற்றியால் அவற்றை கணினிக்கு புரிந்த வடிவத்துக்கு
           மாற்றுகிறோம்.`,
           `இறுதியில், லஸ்ஸி ஒரு சர்வதேச நிரல்மொழிமாற்றி, வேறு ஒன்றும் இல்லை.
           `]
        },
        {
          'கேள்வி': 'ஆனால் எல்லோருக்கும் ஆங்கிலம் தெரியாதா?',
          'பதில்': [`ஆமாம், எல்லோருக்கும் [தெரியாது](https://cdn.statcdn.com/Infographic/images/normal/14919.jpeg).
          இப்பொழுது வரை ஆங்கில தவிர வேறு மொழிகளில்
          நிரலாக்கம் செய்கிறதற்கு கருவிகள் இல்லை என்றதால், குறையாக ஒரு அளவ்வுக்கு ஆங்கில படிக்க முடியாத
          நபர்களால் நிரலாக்கம் [கற்றுக்கொள்ள முடியவில்லை](https://mako.cc/copyrighteous/scratch-localization-and-learning).
          அதனால் நிரல் எழுதும் நபர்கள் எல்லோருக்கும் ஆங்கிலம் தெரியும்,
          எனென்றால் இவர்களை தவிர வேறு யாருக்குமே வாய்ப்பு கிடைக்கவில்லை. நிரலாக்கத்தில் பன்முகத்தன்மையின் முக்கியத்துவம்
          அறிந்து, இந்த புலத்தில் சமத்துவத்தை மேம்படுத்துகிறதற்கு லஸ்ஸி திட்டம் ஆரம்பப்பட்டுள்ளது.
          `]
        },
        {
          'கேள்வி': 'சரி, அப்புறம் அவர்களால் ஆங்கிலம் கற்றுக்கொள்ள முடியாதா?',
          'பதில்': [`நீங்கள் எந்த மொழி கற்றுக்கொள்ள விரும்பினாலோ, அதை கண்டிப்பாக கற்றுக்கொள்ளுங்கள்.
          ஆனால் ஆங்கில மொழி மட்டுமே பேசி எத்தனை வெற்றிகரமான நிரல் எழுத்தாளர்கள் இருக்கிறார்கள்? அதே மாதிரி
          எல்லோருக்கும் நிரலாக்க புலத்தில் சம வாய்ப்பு பெறும் உரிமை இருக்கிறது.`,
          `உங்கள் தாய்மொழி எந்த மொழி இருந்தாலோ, அதற்கு மேலே வேறு மொழிகள் தெரிந்தாலோ தெரியாவிட்டாலோ,
          நிரலாக்கத்தில் உங்களுக்காக ஒரு இடம் காத்திருக்கிறது.
          `]
        },
        {
          'கேள்வி': `ஏற்கனவை உபயோகத்தில் உள்ள [எழில்](https://github.com/Ezhil-Language-Foundation/Ezhil-Lang),
          [हिंदावी](https://sourceforge.net/projects/hindawi/)
          அல்லது [قلب](https://github.com/nasser/---) மாதிரி நிரல்மொழிகளை எதற்கு பயன் செய்ய வேண்டாம்?`,
          'பதில்': [`கண்டிப்பாக பயன் செய்ய வேண்டும்! ஆனால் உலகத்தில் [௭௲ (ஏழாாயிரம்) த்துக்கு மேலே](https://glottolog.org/glottolog/language)
          வேவ்வேறு இயற்கை அல்லது மனிதர் மொழிகள்
          உள்ளன. அதற்கு மேலே ஏற்கனவை ஆங்கில மொழி மூலமான பல நிரல்மொழிகள் உபயோகத்தில் உள்ளன.
          ஒவ்வொரு மனிதர் மொழியுக்காக புதுச நிரல்மொழி [உருவாக்க முடியாது](https://www.mic.com/articles/130331/this-arabic-programming-language-shows-how-computers-revolve-around-the-western-world).
          முடிந்தாலும், பல பொதுவான நிரல் தொகுதிகளை தேவை இல்லாமல் மறுப்படியும் ஒவ்வொரு புதுச மொழியில் உருவாக்க வேண்டியது. உதாரணத்துக்காக,
          யாவாக்கிறிட்டுக்கு தற்பொது [௲௲ (பத்து லச்சியம்) த்துக்கு மேலே](https://www.npmjs.com/) தனிப்பட்ட சமூக தொகுதிகள் கிடைக்கும்.`,
          `லஸ்ஸி ஒரு புது நிரல்மொழியல்ல. அதாவது லஸ்ஸி ஏற்கனவை உபயோகத்தில் உள்ள நிரல்மொழிகளை வேவ்வேறு
          மனிதர் மொழிகளுக்கு கொண்டு வரும் ஒரு கருவி ஆகும்.
          `]
        }
      ],
    }),
};
</script>
<style scoped>
</style>
